In [1]:
import numpy as np
import pandas as pd

Numpy is foundational to Data Science in Python.  Most data you will analyze whether text, video, sound ultimatley gets converted to numerical arrays to be analyzed.  So efficient storage and

In [3]:
array_2d = np.array([[1,2,3,4],[4,5,6,7]])

In [4]:
array_2d

array([[1, 2, 3, 4],
       [4, 5, 6, 7]])

In [5]:
array_2d[0]

array([1, 2, 3, 4])

In [6]:
array_2d[0,1]

2

In [7]:
array_2d[:,1]

array([2, 5])

In [9]:
array_2d[0:2,::2]

array([[1, 3],
       [4, 6]])

In [10]:
array_2d_2 = array_2d[:]

In [11]:
array_2d_2[1,3]=88

In [12]:
array_2d_2

array([[ 1,  2,  3,  4],
       [ 4,  5,  6, 88]])

In [13]:
array_2d_2

array([[ 1,  2,  3,  4],
       [ 4,  5,  6, 88]])

In [14]:
array_2d_copy = array_2d.copy()

In [15]:
array_2d_copy[0,0]=90

In [16]:
array_2d_copy

array([[90,  2,  3,  4],
       [ 4,  5,  6, 88]])

In [17]:
array_2d

array([[ 1,  2,  3,  4],
       [ 4,  5,  6, 88]])

In [22]:
array_1 = np.array([1.0,2,1.5,'a'])

In [23]:
array_1

array(['1.0', '2', '1.5', 'a'],
      dtype='<U32')

In [24]:
array_1.dtype

dtype('<U32')

In [25]:
#reverse 2d array
array_2d = np.arange(1,10).reshape(3,3)

In [26]:
array_2d

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [27]:
array_2d[::-1]

array([[7, 8, 9],
       [4, 5, 6],
       [1, 2, 3]])

In [28]:
array_2d[:,::-1]

array([[3, 2, 1],
       [6, 5, 4],
       [9, 8, 7]])

In [29]:
array_2d[::-1,::-1]

array([[9, 8, 7],
       [6, 5, 4],
       [3, 2, 1]])

In [30]:
#concatentation
array_1 = np.array([1,2,3])
array_2 = np.array([4,5,6])
array_3 = np.array([7,8,9])

In [31]:
array_4 = np.concatenate([array_1,array_2,array_3])

In [32]:
array_4

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [37]:
grid = array_4.reshape(3,3)

In [38]:
np.concatenate([grid,grid])

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9],
       [1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [39]:
np.concatenate([grid,grid],axis=1)

array([[1, 2, 3, 1, 2, 3],
       [4, 5, 6, 4, 5, 6],
       [7, 8, 9, 7, 8, 9]])

In [42]:
array_4

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [44]:
np.split(array_4,[3,6])

[array([1, 2, 3]), array([4, 5, 6]), array([7, 8, 9])]

In [45]:
grid

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [47]:
np.vsplit(grid,[1,2])

[array([[1, 2, 3]]), array([[4, 5, 6]]), array([[7, 8, 9]])]

In [48]:
np.hsplit(grid,[1,2])

[array([[1],
        [4],
        [7]]), array([[2],
        [5],
        [8]]), array([[3],
        [6],
        [9]])]

In [51]:
array_4

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [52]:
np.sum(array_4)

45

In [53]:
1/array_4

array([ 1.        ,  0.5       ,  0.33333333,  0.25      ,  0.2       ,
        0.16666667,  0.14285714,  0.125     ,  0.11111111])

In [54]:
np.divide(1,array_4)

array([ 1.        ,  0.5       ,  0.33333333,  0.25      ,  0.2       ,
        0.16666667,  0.14285714,  0.125     ,  0.11111111])

In [55]:
np.divide(array_4,2)

array([ 0.5,  1. ,  1.5,  2. ,  2.5,  3. ,  3.5,  4. ,  4.5])

In [56]:
array_4 ** 2

array([ 1,  4,  9, 16, 25, 36, 49, 64, 81], dtype=int32)

In [57]:
np.power(2,array_4)

array([  2,   4,   8,  16,  32,  64, 128, 256, 512], dtype=int32)

In [58]:
grid

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [60]:
a = -(0.5 * grid -3) *3

In [61]:
a

array([[ 7.5,  6. ,  4.5],
       [ 3. ,  1.5, -0. ],
       [-1.5, -3. , -4.5]])

In [62]:
np.abs(a)

array([[ 7.5,  6. ,  4.5],
       [ 3. ,  1.5,  0. ],
       [ 1.5,  3. ,  4.5]])

In [63]:
a

array([[ 7.5,  6. ,  4.5],
       [ 3. ,  1.5, -0. ],
       [-1.5, -3. , -4.5]])

In [64]:
array_4 * array_4

array([ 1,  4,  9, 16, 25, 36, 49, 64, 81])

In [65]:
grid

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [66]:
grid[[0,2],[1]]

array([2, 8])

In [67]:
grid < 5

array([[ True,  True,  True],
       [ True, False, False],
       [False, False, False]], dtype=bool)

In [68]:
grid[grid<5]

array([1, 2, 3, 4])

In [69]:
grid[(grid > 2) & (grid < 5)]

array([3, 4])

In [70]:
series_1 = pd.Series([1,2,3,4])

In [71]:
series_1

0    1
1    2
2    3
3    4
dtype: int64

In [72]:
series_1[1]

2

In [73]:
series_2 = pd.Series([1,2,3,4,5,6,7],index=['a','b','c','d','e','f','g'])

In [74]:
series_2

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [75]:
series_2['b']

2

In [76]:
series_2['a':'d']

a    1
b    2
c    3
d    4
dtype: int64

In [77]:
series_2.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [78]:
series_2.values

array([1, 2, 3, 4, 5, 6, 7], dtype=int64)

In [79]:
#Dataframes
series_1 = pd.Series({'Paul':55,'John':27,'Jill':37})
series_2 = pd.Series({'Paul':68,'John':72,'Jill':64})

In [80]:
df = pd.DataFrame({'Age':series_1,'Height':series_2})

In [81]:
df

      Age  Height
Jill   37      64
John   27      72
Paul   55      68

In [82]:
df.index

Index(['Jill', 'John', 'Paul'], dtype='object')

In [83]:
df.columns

Index(['Age', 'Height'], dtype='object')

In [84]:
df['Age']

Jill    37
John    27
Paul    55
Name: Age, dtype: int64

In [85]:
df['Weight'] = pd.Series({'Paul': 180,'John':150,'Jill':130})

In [86]:
df

      Age  Height  Weight
Jill   37      64     130
John   27      72     150
Paul   55      68     180

In [87]:
df[['Height','Weight']]

      Height  Weight
Jill      64     130
John      72     150
Paul      68     180

In [88]:
df['Height'] > 65

Jill    False
John     True
Paul     True
Name: Height, dtype: bool

In [89]:
df[df['Height']>65]

      Age  Height  Weight
John   27      72     150
Paul   55      68     180

In [90]:
df

      Age  Height  Weight
Jill   37      64     130
John   27      72     150
Paul   55      68     180

In [92]:
s = df['Age']

In [93]:
s

Jill    37
John    27
Paul    55
Name: Age, dtype: int64

In [94]:
s[1]

27

In [95]:
s2 = pd.Series([1,2,3,4,5],index=[1,2,2,3,4])

In [96]:
s2

1    1
2    2
2    3
3    4
4    5
dtype: int64

In [98]:
s2[1]

1

In [99]:
s2.loc[1:3]

1    1
2    2
2    3
3    4
dtype: int64

In [100]:
s2.iloc[1:3]

2    2
2    3
dtype: int64

In [101]:
df

      Age  Height  Weight
Jill   37      64     130
John   27      72     150
Paul   55      68     180

In [102]:
df.transpose()

        Jill  John  Paul
Age       37    27    55
Height    64    72    68
Weight   130   150   180

In [103]:
df.T

        Jill  John  Paul
Age       37    27    55
Height    64    72    68
Weight   130   150   180

In [104]:
df.loc[df['Age']>30,['Height']]

      Height
Jill      64
Paul      68

In [105]:
df = pd.read_csv('./data/test_load.csv')

In [106]:
df

        date  customerid  orderid   item  itemprice  quantity
0   1/1/2017           1     1002  item1         10         1
1   2/5/2017           2     1003  item1         10         2
2  6/23/2017           3     1004  item2         15         3
3  9/30/2017           2     1005  item3         20         1
4  12/1/2017           1     1006  item4          5         5
5   1/1/2018           1     1007  item3         20         1
6   2/8/2018           4     1008  item5          3         6
7  3/20/2018           5     1009  item6          1        10

In [107]:
df = pd.read_csv('./data/test_load.csv',usecols=['date','customerid'])

In [110]:
df

        date  customerid
0   1/1/2017           1
1   2/5/2017           2
2  6/23/2017           3
3  9/30/2017           2
4  12/1/2017           1
5   1/1/2018           1
6   2/8/2018           4
7  3/20/2018           5

In [111]:
df = pd.read_csv('./data/test_load.csv',parse_dates=True)

In [112]:
df['date']

0     1/1/2017
1     2/5/2017
2    6/23/2017
3    9/30/2017
4    12/1/2017
5     1/1/2018
6     2/8/2018
7    3/20/2018
Name: date, dtype: object

In [116]:
df = pd.read_csv('./data/test_load.csv',parse_dates=True,index_col='date')

In [117]:
df

            customerid  orderid   item  itemprice  quantity
date
2017-01-01           1     1002  item1         10         1
2017-02-05           2     1003  item1         10         2
2017-06-23           3     1004  item2         15         3
2017-09-30           2     1005  item3         20         1
2017-12-01           1     1006  item4          5         5
2018-01-01           1     1007  item3         20         1
2018-02-08           4     1008  item5          3         6
2018-03-20           5     1009  item6          1        10

In [118]:
df.index.year

Int64Index([2017, 2017, 2017, 2017, 2017, 2018, 2018, 2018], dtype='int64', name='date')

In [119]:
df = pd.read_csv('./data/test_load.csv',parse_dates=True)

In [120]:
df

        date  customerid  orderid   item  itemprice  quantity
0   1/1/2017           1     1002  item1         10         1
1   2/5/2017           2     1003  item1         10         2
2  6/23/2017           3     1004  item2         15         3
3  9/30/2017           2     1005  item3         20         1
4  12/1/2017           1     1006  item4          5         5
5   1/1/2018           1     1007  item3         20         1
6   2/8/2018           4     1008  item5          3         6
7  3/20/2018           5     1009  item6          1        10

In [123]:
df.set_index('orderid',inplace=True)

In [124]:
df

              date  customerid   item  itemprice  quantity
orderid
1002      1/1/2017           1  item1         10         1
1003      2/5/2017           2  item1         10         2
1004     6/23/2017           3  item2         15         3
1005     9/30/2017           2  item3         20         1
1006     12/1/2017           1  item4          5         5
1007      1/1/2018           1  item3         20         1
1008      2/8/2018           4  item5          3         6
1009     3/20/2018           5  item6          1        10

In [125]:
df['totalprice']=df['itemprice']*df['quantity']

In [126]:
df

              date  customerid   item  itemprice  quantity  totalprice
orderid
1002      1/1/2017           1  item1         10         1          10
1003      2/5/2017           2  item1         10         2          20
1004     6/23/2017           3  item2         15         3          45
1005     9/30/2017           2  item3         20         1          20
1006     12/1/2017           1  item4          5         5          25
1007      1/1/2018           1  item3         20         1          20
1008      2/8/2018           4  item5          3         6          18
1009     3/20/2018           5  item6          1        10          10